/*
    Задача 7:
    Имате предварително въведени стойности от естествени числа,
    въведени в квадратна таблица с размери 6 реда и 6 колони.
    Да се състави програма , чрез която се намира сумата на всички
    елементи, чиято сума на индекси за ред и колона е четно число.
    Програмата да извежда формираните суми за всеки отделен ред на
    квадратната таблица, както и общата сума от тези елементи.
    Да се използва само един цикъл.
    Пример:
    11,12,13,14,15,16,
    21,22,23,24,25,26,
    31,32,33,34,35,36,
    41,42,43,44,45,46,
    51,52,53,54,55,56,
    61,62,63,64,65,66
    Изход:
    11, ,13, ,15, , сума от елементите за реда: 39
    22, ,24, ,26, сума от елементите за реда: 72
    31, ,33, ,35, , сума от елементите за реда: 99
    42, ,44, ,46, сума от елементите за реда: 132
    51, ,53, ,55, , сума от елементите за реда: 159
    62, ,64, ,66 сума от елементите за реда: 192
    Сума на елементите: 693
*/

var array = [
    [11, 12, 13, 14, 15, 16],
    [21, 22, 23, 24, 25, 26],
    [31, 32, 33, 34, 35, 36],
    [41, 42, 43, 44, 45, 46],
    [51, 52, 53, 54, 55, 56],
    [61, 62, 63, 64, 65, 66]
];

var result = "";
var totalSum = 0;

// Само с един цикъл
for (var row = 0; row < array.length; row++) {
    var col, sum = 0;
    row % 2 == 0 ? col = 0 : col = 1;
    sum += array[row][col] + array[row][col + 2] + array[row][col + 4];
    totalSum += sum;
    result += array[row][col] + ", " + array[row][col + 2] + ", " + array[row][col + 4] + ", сума от елементите за реда: " + sum + "\n";
}
result += "Сума на елементите: " + totalSum;
console.log(result);

/*
// Със един вложен for
for (var row = 0; row < array.length; row++) {
    var currentRowSum = 0;
    for (var col = 0; col < array.length; col++) {
        if ((row + col) % 2 == 0) {
            currentRowSum += array[row][col];
            result += array[row][col] + ", "
        }
    }
    result += "сума от елементите за реда: " + currentRowSum + "\n";
    totalSum += currentRowSum;
}
result += "Сума на елементите: " + totalSum;
console.log(result);
*/