/*
    Задача 1:
    Имате двумерен масив 6х5 от естествени числа, чийто стойности са
    въведени предварително.
    Да се състави програма, чрез която се извеждат елементите от масива
    с най-малката и най-голямата стойност.
    Пример:
    48,72,13,14,15
    21,22,53,24,75
    31,57,33,34,35
    41,95,43,44,45
    59,52,53,54,55
    61,69,63,64,65
    Изход:
    най-малко 13;
    най-голямо 95
*/

var array = [
    [48, 72, 13, 14, 15],
    [21, 22, 53, 24, 75],
    [31, 57, 33, 34, 35],
    [41, 95, 43, 44, 45],
    [59, 52, 53, 54, 55],
    [61, 69, 63, 64, 65]
]

var max = array[0][0];
var min = array[0][0];

for (var row = 0; row < array.length; row++) {
    for (var col = 0; col < array[row].length; col++) {
        if (array[row][col] > max) {
            max = array[row][col];
        }

        if (array[row][col] < min) {
            min = array[row][col];
        }
    }
}

console.log("Minimum value: " + min + ";");
console.log("Maximum value: " + max + ";");