/*
    Задача 14:
    Имате предварително въведен едномерен масив, съдържащ реални
    числа.
    Да се състави програма, чрез която се избират само елементи със
    стойности от интервала [-2.99..2.99] и новата редица се извежда на
    екрана.
    Пример: 7.1, 8.5, 0.2, 3.7, 0.99, 1.4, -3.5, -110, 212, 341, 1.2
    Изход: 0.2; 0.99; 1.4; 1.2
*/

var array = [7.1, 8.5, 0.2, 3.7, 0.99, 1.4, -3.5, -110, 212, 341, 1.2];
var newArray = new Array();

for (var index = 0; index < array.length; index++) {
    if (array[index] >= -2.99 && array[index] <= 2.99) {
        newArray.push(array[index]);
    }
}

console.log(newArray);